BTReddit/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def new
    @post = Post.find_by(id: params[:post_id])

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "lets party"], ["author_id", 2], ["post_id", 7], ["created_at", "2018-11-21 00:49:11.969526"], ["updated_at", "2018-11-21 00:49:11.969526"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    if @comment.save