BTReddit/app/controllers/posts_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @post = Post.new
    @sub = Sub.find_by(id: params[:sub_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id])
    @sub = Sub.find_by(id: params[:sub_id])

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 9], ["sub_id", 1], ["created_at", "2018-11-21 00:19:45.349035"], ["updated_at", "2018-11-21 00:19:45.349035"]]
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dfghd"], ["url", "dhsgdf"], ["content", "dgsndfbg"], ["author_id", 2], ["created_at", "2018-11-20 23:01:35.405569"], ["updated_at", "2018-11-20 23:01:35.405569"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "ngfxcjgclhjcv;."], ["updated_at", "2018-11-20 22:05:47.213893"], ["id", 6]]
---
  def update
    @post = Post.find_by(id: params[:id])
    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def ensure_author
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find_by(id: params[:id])