BTReddit/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_moderator_status
    unless current_user.is_moderator?(Sub.find_by(id: params[:id]))

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "w;eorubf;sfadjvbsgbsgfa;djvbad"], ["updated_at", "2018-11-20 20:06:43.899821"], ["id", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update_attributes(sub_params)