BTReddit/app/views/posts/edit.html.erb

  <ul>
  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"

        <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
        <%= "checked" if @post.subs.include?(sub) %>>
---
SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["post_id", 7], ["id", 1], ["LIMIT", 1]]