BTReddit/app/views/posts/new.html.erb

  <ul>
  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"