BTReddit/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
---
<ul>
  <% @post.comments.each do |comment| %>

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 7]]
---
<ul>
  <% @post.subs.each do |sub| %>